In [2]:
#connecting the database
#importing the Sqlite3 module
import sqlite3
conn=sqlite3.connect("E:\DBMS\kkk.sqlite")
cursor=conn.cursor()
print("Opened Database successfully")

Opened Database successfully

Database query-is not a case sensitive,
SQL-structure Query language

In [3]:
#creating the table inside our DB
conn=sqlite3.connect("E:\DBMS\kkk.sqlite")
cursor=conn.cursor()
cursor.execute('''CREATE TABLE EDUVERSE
                (ID INT PRIMARY KEY NOT NULL,
                NAME TEXT NOT NULL,
                AGE INT NOT NULL,
                ADDRESS CHAR(50),
                SALARY INT);
                ''')
#conn.close()
#or
cursor.close()

In [4]:
#inserting the value into the table
conn=sqlite3.connect("E:\DBMS\kkk.sqlite")
cursor=conn.cursor()
cursor.execute("Insert into EDUVERSE values(101,'Sarvana',31,'Anna nagar,Chennai',70000)")
cursor.execute("Insert into EDUVERSE values(102,'Karthik',23,'West street,Tiruchendur',80000)")
cursor.execute("Insert into EDUVERSE values(103,'Raja',24,'Gandhi street,Chennai',60000)")
cursor.execute("Insert into EDUVERSE values(104,'Mani',25,'North street,Madurai',50000)")
cursor.execute("Insert into EDUVERSE values(105,'Baby',23,'central nagar,Coimbatore',30000)")
conn.commit()#to save the data's
conn.close()

In [10]:
#how to select the all datas in the database
conn=sqlite3.connect("E:\DBMS\kkk.sqlite")
cursor=conn.cursor()
query="SELECT * FROM Eduverse"
cursor.execute(query)
data=cursor.fetchall()
print("TYPE OF THE DATA IS:\n",type(data))
print('\n')
print(data)

TYPE OF THE DATA IS:
 <class 'list'>


[(101, 'Sarvana', 31, 'Anna nagar,Chennai', 70000), (102, 'Karthik', 23, 'West street,Tiruchendur', 80000), (103, 'Raja', 24, 'Gandhi street,Chennai', 60000), (104, 'Mani', 25, 'North street,Madurai', 50000), (105, 'Baby', 23, 'central nagar,Coimbatore', 30000)]

In [16]:
#to select the Specific column from the database
conn=sqlite3.connect("E:\DBMS\kkk.sqlite")
cursor=conn.cursor()
for row in cursor.execute("Select ID,NAME,AGE,SALARY FROM EDUVERSE"):
    print('ID==',row[0])
    print('NAME==',row[1])
    print('AGE==',row[2])
    print('SALARY==',row[3],'\n')
conn.commit()
conn.close()

ID== 101
NAME== Sarvana
AGE== 31
SALARY== 70000

ID== 102
NAME== Karthik
AGE== 23
SALARY== 80000

ID== 103
NAME== Raja
AGE== 24
SALARY== 60000

ID== 104
NAME== Mani
AGE== 25
SALARY== 50000

ID== 105
NAME== Baby
AGE== 23
SALARY== 30000

In [17]:
#how to select the one data in the database
conn=sqlite3.connect("E:\DBMS\kkk.sqlite")
cursor=conn.cursor()
query="SELECT * FROM Eduverse"
print("Getting only one data from the table")
cursor.execute(query)
data=cursor.fetchone()
print(data)
conn.close()

Getting only one data from the table
(101, 'Sarvana', 31, 'Anna nagar,Chennai', 70000)

In [20]:
#how to select the specific number of data in the database
conn=sqlite3.connect("E:\DBMS\kkk.sqlite")
cursor=conn.cursor()
query="SELECT * FROM Eduverse"
print("Getting only one or more data from the table")
cursor.execute(query)
data=cursor.fetchmany(3)#it's display 3 rows
print(data)
conn.close()

Getting only one or more data from the table
[(101, 'Sarvana', 31, 'Anna nagar,Chennai', 70000), (102, 'Karthik', 23, 'West street,Tiruchendur', 80000), (103, 'Raja', 24, 'Gandhi street,Chennai', 60000)]

In [23]:
#get input from user and insert into database
conn=sqlite3.connect("E:\DBMS\kkk.sqlite")
cursor=conn.cursor()
i=input('Enter the ID:')
n=input('Enter the Name:')
a=input('Enter the Age:')
add=input('Enter the Address:')
s=input('Enter Your Salary:')
query="insert into Eduverse (ID,NAME,AGE,ADDRESS,SALARY) values("+i +",'"+n+"',"+a+",'"+add+"',"+s+")"
conn.execute(query)
conn.commit()
conn.close()
print('Data saved Successfully!!!')

Enter the ID:200
Enter the Name:reshma
Enter the Age:23
Enter the Address:Anna nagar,chennai
Enter Your Salary:70000
Data saved Successfully!!!

In [24]:
#update-it is used to update an existing record in database table
conn=sqlite3.connect("E:\DBMS\kkk.sqlite")
cursor=conn.cursor()
query="Update eduverse SET SALARY=100000 WHERE ID=200"
conn.execute(query)
conn.commit()
conn.close()
print("Saved Successfully!!")

Saved Successfully!!